groupGirls=["Марія","Мама Ліля","Бабуся Валя","Тетя Оля","Тетя Світлана","Агнія"]
groupBoys=[ "Іван", "Тато Сергій", "Дідусь Петя", "Дідусь Саша", "Дядя Петя","Дядя Юрій","Аарон"]      
adjGirls=["Зіркова","Чарівна","Білосніжна","Запальна","Кольорова","Хоробра","Танцююча","Мудра","Несамовита","Весела","Ковбойська"]
adjBoys=["Приязний","Чудернацький","Веселий","Сором'язливий","Невгамовний","Гуманний",
    "Казковий", "Хоробрий","Кмітливий","Всемогутній","Навіжений", "Несамовитий", "Горделивий","",""]  
costumeGirls=["Фея","Ялинка","Мандаринка","Панда","Бджчілка Мая","Балерина"]  
costumeBoys=["Чебурек","Пінгвін","Панда","Маленький Йода","Кіт Степан","Їжачок","Кактус",
    "Мачо","Єдиноріг","Моряк","Пес Патрон","Хірург","Огірок","Сніговик","Кентавр","Покемон"]
with=["з мармеладкою","у віночку", "на мопеді","на підборах","з качкою",
        "з кавуном","з зеленим волоссям","з золотими зубами","у тракторі",
        "на коні","з відром","на вєліку","з чудернацькою шапкою",
        "в ластах","у зелених шльопках","в навушниках","на роликах"]    
groupGirls.shuffle! #перетасувати список і записати в ту ж змінну
adjGirls.shuffle!
costumeGirls.shuffle!
with.shuffle!
for i in 0..groupGirls.length-1
    puts "#{groupGirls[i]} - костюм: #{adjGirls[i]} #{costumeGirls[i]} #{with[i]}"  
end  


groupBoys.shuffle! #перетасувати список і записати в ту ж змінну
adjBoys.shuffle!
costumeBoys.shuffle!
with.shuffle!
for i in 0..groupBoys.length-1
    puts "#{groupBoys[i]} - костюм: #{adjBoys[i]} #{costumeBoys[i]} #{with[i]}"  
end 
